sequences/incoming_referral_import.puml
@startuml
autonumber

title Receiving a referral

box "Zuyderland"
    actor "Care provider" as zp
    participant "EPD" as ze
    participant "Firely Auth" as za
    participant "Firely Server" as zf
end box

box "Zuyderland IOP node"
    participant "FHIR interface" as zif
end box

box "HINQ"
    participant "ZNO" as hz
    participant "Nuts node" as hn
end box

box "MUMC"
    participant "Parsek FHIR interface" as mf
    participant "Firely Server" as mf
end box


ze->zp: Notification about incoming referral
zp->ze: Open referral application
ze->hz: Redirect to ZNO
...SMART EHR Launch SSO flow...
hz->hn: Search for workflow AuthorizationCredentials\n(""purposeOfUse"" = ""bgz-sender"")
note over hz,hn
**Problem**
The AuthorizationCredential is a private credential issued to the organization
at the Zuyderland node, not the organization at the HINQ node. The HINQ node therefore
can't find it.
end note
hn->hz: Available workflow AuthorizationCredentials
note over hz
**Question**
How do we determine which referrals
are pending and not completed yet?

Spec says AuthorizationCredentials should be revoked
when the Task is updated. Does Parsek do that?
Or should we get the status from the workflow Task resource?
end note
hz->zp: Present pending referrals and option to start a new referral
zp->hz: Select pending referral
hz->hz: Get necessary info from workflow AuthorizationCredential
note over hz
**To extract**
- ""issuer"", the DID of the sending organization
- ""resources[0].path"", the ID of the workflow Task resource (""Task/123"")
end note
hz->hn: Look up bgz-sender service endpoints of\nsending organization using DID
hn->hz: Token and FHIR endpoints
hz->hn: Request access token for workflow Task
hn->hz: Access token
hz->mf **: Read workflow Task (""GET Task/123"")
mf->hz: Workflow Task
note over hz
**To extract**
- ""input.authorization-base"", DID of the AuthorizationCredential needed to
  retrieve the data.
  - ""input:read-available-resources"", all the to be executed FHIR reads to get the data
  - ""input:query-available-resources"", all the to be executed FHIR searches to get the data
end note
hz->hz: Check workflow Task still has status ""requested""
hz->mf: Execute all the FHIR requests
mf->hz: Responses
hz->zp: Present resources
zp->hz: Select resources to import
hz->hn: Find DID of Zuyderland organization at Zuyderland node
hn->hz: Zuyderland DID
hz->hn: Request same-organization access token
note over hz,hn
**Question**
How do we determine that this access token is meant for a referral import?
Do we use some sort of custom ""purposeOfUse"" in the access token request?
end note
hn->hz: Access token
hz->zif: Send all selected resources\n(POST transaction Bundle)
note over za,zif: Insert SMART Backend Service flow here
zif->zif: Validate same-organization\naccess token
zif->zf: Import resources
zf->zif: Ok
zif->hz: Ok
hz->mf: Update workflow Task with status ""completed"" (""PUT Task/123"")
mf->hz: Ok
hz->zp: Present success page

@enduml
